pages/explore.org
#+BEGIN_COMMENT
.. title: Explore
.. slug: explore
.. date: 2021-11-22 22:57:00 UTC+08:00
.. tags: page, explore
.. category: page
.. type: page
.. hidetitle: True
.. nocomments: True
/.. status: draft
#+END_COMMENT

* newsletter

https://news.ycombinator.com/news (hacker news)

https://cn.reuters.com/theWire (路透中文)


* personal blog

https://www.netmeister.org/blog/ (操作系统编程)

http://www.ruanyifeng.com/blog/ (科技爱好者周刊)

https://preshing.com/ (C++编程)

https://larahogan.me/blog/ (项目管理、团队管理)

https://danwang.co/ (社会观察、政治分析)

https://coolshell.cn/ (软件开发)

https://blog.binchen.org/ （emacs，编辑器技巧）


* forum

https://emacs-china.org/

https://www.reddit.com/
