explore/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Explore | English Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/english_note/rss.xml">
<link href="/english_note/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://samsonwang.github.io/english_note/explore/">
<link rel="icon" href="/english_note/favicon.ico" sizes="64x64">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="English Note">
<meta property="og:title" content="Explore">
<meta property="og:url" content="https://samsonwang.github.io/english_note/explore/">
<meta property="og:description" content="newsletter


https://news.ycombinator.com/news (hacker news)



https://cn.reuters.com/theWire (路透中文)






personal blog


https://www.netmeister.org/blog/ (操作系统编程)



http://www.ruanyifeng.com/blog/">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-11-22T22:57:00+08:00">
<meta property="article:tag" content="explore">
<meta property="article:tag" content="page">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/english_note/">English Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/english_note/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/english_note/">Home</a>
            <a class="page-link" href="/english_note/archive/">Archive</a>
            <a class="page-link" href="/english_note/tags/">Tags</a>
            <a class="page-link" href="/english_note/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post-page storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header></header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org0a4e1ef" class="outline-2">
<h2 id="org0a4e1ef">newsletter</h2>
<div class="outline-text-2" id="text-org0a4e1ef">
<p>
<a href="https://news.ycombinator.com/news">https://news.ycombinator.com/news</a> (hacker news)<br></p>

<p>
<a href="https://cn.reuters.com/theWire">https://cn.reuters.com/theWire</a> (路透中文)<br></p>
</div>
</div>


<div id="outline-container-orgeee4db6" class="outline-2">
<h2 id="orgeee4db6">personal blog</h2>
<div class="outline-text-2" id="text-orgeee4db6">
<p>
<a href="https://www.netmeister.org/blog/">https://www.netmeister.org/blog/</a> (操作系统编程)<br></p>

<p>
<a href="http://www.ruanyifeng.com/blog/">http://www.ruanyifeng.com/blog/</a> (科技爱好者周刊)<br></p>

<p>
<a href="https://preshing.com/">https://preshing.com/</a> (C++编程)<br></p>

<p>
<a href="https://larahogan.me/blog/">https://larahogan.me/blog/</a> (项目管理、团队管理)<br></p>

<p>
<a href="https://danwang.co/">https://danwang.co/</a> (社会观察、政治分析)<br></p>

<p>
<a href="https://coolshell.cn/">https://coolshell.cn/</a> (软件开发)<br></p>

<p>
<a href="https://blog.binchen.org/">https://blog.binchen.org/</a> （emacs，编辑器技巧）<br></p>
</div>
</div>


<div id="outline-container-orgcba42ec" class="outline-2">
<h2 id="orgcba42ec">forum</h2>
<div class="outline-text-2" id="text-orgcba42ec">
<p>
<a href="https://emacs-china.org/">https://emacs-china.org/</a><br></p>

<p>
<a href="https://www.reddit.com/">https://www.reddit.com/</a><br></p>
</div>
</div>
    </div>
    

</article>
</div>
  </main><footer class="site-footer h-card"><div class="wrapper">
      <div class="footer-col-wrapper">

        <div class="footer-col">
          <p class="site-desc">Personal handnote on english learning</p>
        </div>

        <div class="footer-col">
          <div class="p-name">Samson Wang</div>
          <div class="copyright">Copyright 2025, all rights reserved.</div>
          <div class="social-links">
            <ul class="social-media-list">
<li><a rel="me" href="/english_note/rss.xml">
                <svg class="svg-icon grey"><use href="/english_note/assets/svg/social-icons.svg#rss"></use></svg></a></li>
              <li><a rel="nofollow" href="https://github.com/samsonwang">
                <svg class="svg-icon grey"><use href="/english_note/assets/svg/social-icons.svg#github"></use></svg></a></li>
              <li><a rel="nofollow" href="https://twitter.com/samsonwangcn">
                <svg class="svg-icon grey"><use href="/english_note/assets/svg/social-icons.svg#twitter"></use></svg></a></li>
              <li><a rel="nofollow" href="https://facebook.com/samsonwangcn">
                 <svg class="svg-icon grey"><use href="/english_note/assets/svg/social-icons.svg#facebook"></use></svg></a></li>
            </ul>
</div>

        </div>

      </div>

    </div>

  </footer><div id="scroll-top" title="back to top">
  <div id="scroll-top-arrow"></div>
  <div id="scroll-top-stick"></div>
</div>


      <script src="/english_note/assets/js/lazyload.min.js"></script><script src="/english_note/assets/js/minima.min.js"></script>
</body>
</html>
